{
  "scrolls": [
    {
      "id": "scroll_home_row_oath",
      "title": "Home Row Oath",
      "summary": "A short pledge for steady wrists before lessons begin.",
      "requiredLessons": 1,
      "body": "Float your wrists and breathe. Let fingers rest on A S D F and J K L ; like lanterns along the wall. Soft taps beat heavy strikes; the castle hears your rhythm first."
    },
    {
      "id": "scroll_courier_notes",
      "title": "Courier Notes",
      "summary": "Messages dashed between lanes during early drills.",
      "requiredLessons": 3,
      "body": "Couriers sprint between towers with parchment tucked in their belts. They pass tips like relay batons: eyes forward, shoulder loose, reset grip every few waves. When hands relax, the words run faster."
    },
    {
      "id": "scroll_signal_flares",
      "title": "Signal Flares",
      "summary": "How defenders mark a clean streak across lessons.",
      "requiredLessons": 5,
      "body": "Signal lamps flash over the battlements whenever a lesson ends without a stumble. Three quick blinks mean steady pace; a long glow means perfect form. The garrison reads those lights like quiet applause."
    },
    {
      "id": "scroll_archivist_margins",
      "title": "Archivist Margins",
      "summary": "Lyra's margin notes on why drills stay short and calm.",
      "requiredLessons": 8,
      "body": "Lyra scribbles in the margins: short passages keep readers relaxed, and light stories are a rest between waves. If tension creeps in, slow to walking speed and rebuild. Letters stay loyal when treated kindly."
    },
    {
      "id": "scroll_watch_captain",
      "title": "Watch Captain's Journal",
      "summary": "An encouraging entry for late night study sessions.",
      "requiredLessons": 12,
      "body": "The watch captain writes by lantern: \"We hold the gate by habits, not haste.\" He circles the mantra twice—breathe, align, glance ahead—and leaves a note for the next reader: take pride in unrolling every scroll."
    }
  ]
}
